tutorials/incompressible/simpleFoam/T3A/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.05)
    (0.02 0 -0.05)
    (0 0.0146724657096209 -0.05)
    (0.0260775342903791 0.0146724657096209 -0.05)
    (0 0 0.05)
    (0.02 0 0.05)
    (0 0.0146724657096209 0.05)
    (0.0260775342903791 0.0146724657096209 0.05)
    (0.04 0 -0.05)
    (0.04 0 0.05)
    (0.0402196699141101 5.30330085889911e-04 -0.05)
    (0.0402196699141101 5.30330085889911e-04 0.05)
    (0.04075 0.00075 -0.05)
    (0.04075 0.02075 -0.05)
    (0.0 1 -0.05)
    (0.0260775342903791 1 -0.05)
    (0.04075 1 -0.05)
    (0.04075 0.00075 0.05)
    (0.04075 0.02075 0.05)
    (0.0 1 0.05)
    (0.0260775342903791 1 0.05)
    (0.04075 1 0.05)
    (0.08 0.00075 -0.05)
    (0.08 0.02075 -0.05)
    (0.08 1.0 -0.05)
    (0.08 0.00075 0.05)
    (0.08 0.02075 0.05)
    (0.08 1.0 0.05)
    (1.14 0.00075 -0.05)
    (1.14 0.02075 -0.05)
    (1.14 1.0 -0.05)
    (1.14 0.00075 0.05)
    (1.14 0.02075 0.05)
    (1.14 1.0 0.05)
    (3.04 0.00075 -0.05)
    (3.04 0.02075 -0.05)
    (3.04 1.0 -0.05)
    (3.04 0.00075 0.05)
    (3.04 0.02075 0.05)
    (3.04 1.0 0.05)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (7 20 1) simpleGrading (0.471868 1 1)
    hex (1 8 10 3 5 9 11 7) (40 20 1) simpleGrading (0.022 1 1)
    hex (3 10 12 13 7 11 17 18) (40 20 1) simpleGrading (0.022 1 1)
    hex (2 3 15 14 6 7 20 19) (7 40 1) simpleGrading (0.471868 50.03857 1)
    hex (3 13 16 15 7 18 21 20) (20 40 1) simpleGrading (1 50.03857 1)
    hex (12 22 23 13 17 25 26 18) (80 40 1) simpleGrading (70.9389 45.455 1)
    hex (13 23 24 16 18 26 27 21) (80 40 1) simpleGrading (70.9389 50.03857 1)
    hex (22 28 29 23 25 31 32 26) (160 40 1) simpleGrading (7.2902 45.455 1)
    hex (23 29 30 24 26 32 33 27) (160 40 1) simpleGrading (7.2902 50.03857 1)
    hex (28 34 35 29 31 37 38 32) (60 40 1) simpleGrading (3.9909 45.455 1)
    hex (29 35 36 30 32 38 39 33) (60 40 1) simpleGrading (3.9909 50.03857 1)
);

edges
(
    arc 1 3 (0.0215794997003908 0.00794068122157562 -0.05)
    arc 5 7 (0.0215794997003908 0.00794068122157562 0.05)
    arc 8 10 (0.0400570903506165 2.87012574273817e-04 -0.05)
    arc 9 11 (0.0400570903506165 2.87012574273817e-04 0.05)
    arc 3 13 (0.0328093187784244 0.0191705002996092 -0.05)
    arc 7 18 (0.0328093187784244 0.0191705002996092 0.05)
    arc 10 12 (0.0404629874257262 6.92909649383465e-04 -0.05)
    arc 11 17 (0.0404629874257262 6.92909649383465e-04 0.05)
);

boundary
(
    above
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 8 9 5)
        );
    }

    top
    {
        type patch;
        faces
        (
            (14 15 20 19)
            (15 16 21 20)
            (16 24 27 21)
            (24 30 33 27)
            (30 36 39 33)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2)
            (2 6 19 14)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (34 37 38 35)
            (35 38 39 36)
        );
    }

    plate
    {
        type wall;
        faces
        (
            (8 9 11 10)
            (10 11 17 12)
            (12 22 25 17)
            (22 28 31 25)
            (28 34 37 31)
        );
    }
);


// ************************************************************************* //
